Revit 2027 API
Segment.MaterialId Property
 The ElementId of the MaterialElem.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId MaterialId { get; }
Public ReadOnly Property MaterialId As ElementId
	Get
public:
property ElementId^ MaterialId {
	ElementId^ get ();
}
member MaterialId : ElementId with get
Property Value
ElementId
See Also
Reference
Segment Class
Autodesk.Revit.DB Namespace